MPS/src/Catalogs/ПрограммыАкций/ПрограммыАкций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрограммыАкций</name>
  <attributes>
    <name>ДатаНачалаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПослеЗапуска</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстановкаВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовойПояс</name>
    <type>
      <types>CatalogRef.ЧасовыеПояса</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАкции</name>
    <type>
      <types>EnumRef.ТипыАкций</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментКлиентов</name>
    <type>
      <types>CatalogRef.СегментыПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтбораПоКлиентам</name>
    <type>
      <types>EnumRef.ЕстьНетНеВажно</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничитьПоВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОграничиватьВремяСрабатывания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборПромокодов</name>
    <type>
      <types>CatalogRef.НаборыПромокодов</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьНесколькоПромокодовВЗаказе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПромокодовВЗаказе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

MPS/src/Enums/ТипыАкций/ТипыАкций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыАкций</name>
  <enumValues>
    <name>Скидки</name>
  </enumValues>
  <enumValues>
    <name>Баллы</name>
  </enumValues>
</mdclass:Enum>

MPS/src/Catalogs/ПрограммыАкций/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
	МассивЭлементовОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(Список.Отбор, ,"СлужебныйОтборПоТипуАкции");
	ПараметрыОткрытия = Новый Структура;
	Если не МассивЭлементовОтбора.Количество() = 0 Тогда
		ПараметрыОткрытия.Вставить("ЗначенияЗаполнения",Новый Структура("ТипАкции",МассивЭлементовОтбора[0].ПравоеЗначение));
	КонецЕсли;
	ОткрытьФорму("Справочник.ПрограммыАкций.Форма.ФормаЭлемента", ПараметрыОткрытия)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТипАкции") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"ТипАкции", Параметры.ТипАкции,,"СлужебныйОтборПоТипуАкции");
		//ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТипАкции", Параметры.ТипАкции);
		Если Параметры.ТипАкции = Перечисления.ТипыАкций.Баллы Тогда
			Заголовок = "Балльные акции";
		ИначеЕсли Параметры.ТипАкции = Перечисления.ТипыАкций.Скидки Тогда
			Заголовок = "Скидочные акции";
		КонецЕсли;
	КонецЕсли;	
		
КонецПроцедуры
